ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C2000/f28p551x_epwm_xbar_regs.xml
	<register id="TRIP11MUX16TO31CFG" width="32" page="1" offset="0x1a" internal="0" description="ePWM XBAR Mux Configuration for TRIP11">
		<bitfield id="MUX16" description="Mux16 Configuration for TRIP11 of EPWM-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX17" description="Mux17 Configuration for TRIP11 of EPWM-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX18" description="Mux18 Configuration for TRIP11 of EPWM-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX19" description="Mux19 Configuration for TRIP11 of EPWM-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX20" description="Mux20 Configuration for TRIP11 of EPWM-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX21" description="Mux21 Configuration for TRIP11 of EPWM-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX22" description="Mux22 Configuration for TRIP11 of EPWM-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX23" description="Mux23 Configuration for TRIP11 of EPWM-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX24" description="Mux24 Configuration for TRIP11 of EPWM-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX25" description="Mux25 Configuration for TRIP11 of EPWM-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX26" description="Mux26 Configuration for TRIP11 of EPWM-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX27" description="Mux27 Configuration for TRIP11 of EPWM-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX28" description="Mux28 Configuration for TRIP11 of EPWM-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX29" description="Mux29 Configuration for TRIP11 of EPWM-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX30" description="Mux30 Configuration for TRIP11 of EPWM-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX31" description="Mux31 Configuration for TRIP11 of EPWM-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="TRIP12MUX0TO15CFG" width="32" page="1" offset="0x1c" internal="0" description="ePWM XBAR Mux Configuration for TRIP12">
		<bitfield id="MUX0" description="Mux0 Configuration for TRIP12 of EPWM-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX1" description="Mux1 Configuration for TRIP12 of EPWM-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX2" description="Mux2 Configuration for TRIP12 of EPWM-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX3" description="Mux3 Configuration for TRIP12 of EPWM-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX4" description="Mux4 Configuration for TRIP12 of EPWM-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX5" description="Mux5 Configuration for TRIP12 of EPWM-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX6" description="Mux6 Configuration for TRIP12 of EPWM-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX7" description="Mux7 Configuration for TRIP12 of EPWM-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX8" description="Mux8 Configuration for TRIP12 of EPWM-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX9" description="Mux9 Configuration for TRIP12 of EPWM-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX10" description="Mux10 Configuration for TRIP12 of EPWM-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX11" description="Mux11 Configuration for TRIP12 of EPWM-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX12" description="Mux12 Configuration for TRIP12 of EPWM-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX13" description="Mux13 Configuration for TRIP12 of EPWM-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX14" description="Mux14 Configuration for TRIP12 of EPWM-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX15" description="Mux15 Configuration for TRIP12 of EPWM-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="TRIP12MUX16TO31CFG" width="32" page="1" offset="0x1e" internal="0" description="ePWM XBAR Mux Configuration for TRIP12">
		<bitfield id="MUX16" description="Mux16 Configuration for TRIP12 of EPWM-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX17" description="Mux17 Configuration for TRIP12 of EPWM-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX18" description="Mux18 Configuration for TRIP12 of EPWM-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX19" description="Mux19 Configuration for TRIP12 of EPWM-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX20" description="Mux20 Configuration for TRIP12 of EPWM-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX21" description="Mux21 Configuration for TRIP12 of EPWM-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX22" description="Mux22 Configuration for TRIP12 of EPWM-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX23" description="Mux23 Configuration for TRIP12 of EPWM-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX24" description="Mux24 Configuration for TRIP12 of EPWM-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX25" description="Mux25 Configuration for TRIP12 of EPWM-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX26" description="Mux26 Configuration for TRIP12 of EPWM-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX27" description="Mux27 Configuration for TRIP12 of EPWM-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX28" description="Mux28 Configuration for TRIP12 of EPWM-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX29" description="Mux29 Configuration for TRIP12 of EPWM-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX30" description="Mux30 Configuration for TRIP12 of EPWM-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX31" description="Mux31 Configuration for TRIP12 of EPWM-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="TRIP4MUXENABLE" width="32" page="1" offset="0x20" internal="0" description="ePWM XBAR Mux Enable for TRIP4">
		<bitfield id="MUX0" description="mux0 to drive TRIP4 of EPWM-XBAR" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="MUX1" description="Mux1 to drive TRIP4 of EPWM-XBAR" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="MUX2" description="Mux2 to drive TRIP4 of EPWM-XBAR" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="MUX3" description="Mux3 to drive TRIP4 of EPWM-XBAR" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="MUX4" description="Mux4 to drive TRIP4 of EPWM-XBAR" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MUX5" description="Mux5 to drive TRIP4 of EPWM-XBAR" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="MUX6" description="Mux6 to drive TRIP4 of EPWM-XBAR" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="MUX7" description="Mux7 to drive TRIP4 of EPWM-XBAR" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="MUX8" description="Mux8 to drive TRIP4 of EPWM-XBAR" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="MUX9" description="Mux9 to drive TRIP4 of EPWM-XBAR" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="MUX10" description="Mux10 to drive TRIP4 of EPWM-XBAR" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="MUX11" description="Mux11 to drive TRIP4 of EPWM-XBAR" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="MUX12" description="Mux12 to drive TRIP4 of EPWM-XBAR" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="MUX13" description="Mux13 to drive TRIP4 of EPWM-XBAR" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="MUX14" description="Mux14 to drive TRIP4 of EPWM-XBAR" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="MUX15" description="Mux15 to drive TRIP4 of EPWM-XBAR" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="MUX16" description="Mux16 to drive TRIP4 of EPWM-XBAR" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="MUX17" description="Mux17 to drive TRIP4 of EPWM-XBAR" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="MUX18" description="Mux18 to drive TRIP4 of EPWM-XBAR" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="MUX19" description="Mux19 to drive TRIP4 of EPWM-XBAR" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="MUX20" description="Mux20 to drive TRIP4 of EPWM-XBAR" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="MUX21" description="Mux21 to drive TRIP4 of EPWM-XBAR" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="MUX22" description="Mux22 to drive TRIP4 of EPWM-XBAR" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="MUX23" description="Mux23 to drive TRIP4 of EPWM-XBAR" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="MUX24" description="Mux24 to drive TRIP4 of EPWM-XBAR" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="MUX25" description="Mux25 to drive TRIP4 of EPWM-XBAR" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="MUX26" description="Mux26 to drive TRIP4 of EPWM-XBAR" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="MUX27" description="Mux27 to drive TRIP4 of EPWM-XBAR" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="MUX28" description="Mux28 to drive TRIP4 of EPWM-XBAR" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="MUX29" description="Mux29 to drive TRIP4 of EPWM-XBAR" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="MUX30" description="Mux30 to drive TRIP4 of EPWM-XBAR" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="MUX31" description="Mux31 to drive TRIP4 of EPWM-XBAR" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="TRIP5MUXENABLE" width="32" page="1" offset="0x22" internal="0" description="ePWM XBAR Mux Enable for TRIP5">
		<bitfield id="MUX0" description="mux0 to drive TRIP5 of EPWM-XBAR" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="MUX1" description="Mux1 to drive TRIP5 of EPWM-XBAR" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="MUX2" description="Mux2 to drive TRIP5 of EPWM-XBAR" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="MUX3" description="Mux3 to drive TRIP5 of EPWM-XBAR" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="MUX4" description="Mux4 to drive TRIP5 of EPWM-XBAR" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MUX5" description="Mux5 to drive TRIP5 of EPWM-XBAR" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="MUX6" description="Mux6 to drive TRIP5 of EPWM-XBAR" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="MUX7" description="Mux7 to drive TRIP5 of EPWM-XBAR" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="MUX8" description="Mux8 to drive TRIP5 of EPWM-XBAR" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="MUX9" description="Mux9 to drive TRIP5 of EPWM-XBAR" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="MUX10" description="Mux10 to drive TRIP5 of EPWM-XBAR" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="MUX11" description="Mux11 to drive TRIP5 of EPWM-XBAR" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="MUX12" description="Mux12 to drive TRIP5 of EPWM-XBAR" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="MUX13" description="Mux13 to drive TRIP5 of EPWM-XBAR" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="MUX14" description="Mux14 to drive TRIP5 of EPWM-XBAR" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="MUX15" description="Mux15 to drive TRIP5 of EPWM-XBAR" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="MUX16" description="Mux16 to drive TRIP5 of EPWM-XBAR" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="MUX17" description="Mux17 to drive TRIP5 of EPWM-XBAR" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="MUX18" description="Mux18 to drive TRIP5 of EPWM-XBAR" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="MUX19" description="Mux19 to drive TRIP5 of EPWM-XBAR" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="MUX20" description="Mux20 to drive TRIP5 of EPWM-XBAR" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="MUX21" description="Mux21 to drive TRIP5 of EPWM-XBAR" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="MUX22" description="Mux22 to drive TRIP5 of EPWM-XBAR" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="MUX23" description="Mux23 to drive TRIP5 of EPWM-XBAR" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="MUX24" description="Mux24 to drive TRIP5 of EPWM-XBAR" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="MUX25" description="Mux25 to drive TRIP5 of EPWM-XBAR" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="MUX26" description="Mux26 to drive TRIP5 of EPWM-XBAR" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="MUX27" description="Mux27 to drive TRIP5 of EPWM-XBAR" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="MUX28" description="Mux28 to drive TRIP5 of EPWM-XBAR" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="MUX29" description="Mux29 to drive TRIP5 of EPWM-XBAR" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="MUX30" description="Mux30 to drive TRIP5 of EPWM-XBAR" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="MUX31" description="Mux31 to drive TRIP5 of EPWM-XBAR" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
